app/controllers/api/v1/events_controller.rb

	def index
      @events = Event.all.order(:id).reverse
---
SELECT "events".* FROM "events" ORDER BY "events"."id" ASC

	def create
	  @event = Event.new(post_params)
	if @event.save
---
INSERT INTO "events" ("title", "description", "created_at", "updated_at", "cover") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", ""], ["description", ""], ["created_at", 2017-06-05 13:38:00 UTC], ["updated_at", 2017-06-05 13:38:00 UTC], ["cover", nil]]