app/controllers/api/v1/posts_controller.rb

  def index
    @posts = Post.all.order(:id).reverse
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."id" ASC

  def create
    @post = Post.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "fgsdfg"], ["body", "dsfdasd"], ["created_at", 2017-03-13 23:29:24 UTC], ["updated_at", 2017-03-13 23:29:24 UTC]]