app/controllers/api/v1/subscribings_controller.rb

INSERT INTO "subscribings" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "stokwell1@rambler.ru"], ["created_at", 2017-06-04 13:00:37 UTC], ["updated_at", 2017-06-04 13:00:37 UTC]]
---
  def create
  	@subscribing = Subscribing.new(subscribing_params)

  	respond_to do |format|
      if @subscribing.save